# GroupTypeId Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId Class
Members See Also
---
This class contains constants identifying parameter groups.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static class GroupTypeId
```

Visual Basic
---
```text
Public NotInheritable Class GroupTypeId
```

Visual C++
---
```text
public ref class GroupTypeId abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..GroupTypeId
# See Also
GroupTypeId Members
Autodesk.Revit.DB Namespace